tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "weaveworks/tap"
brew "python@3.11"
brew "ansible"
brew "jpeg-xl"
brew "avro-c"
brew "bash"
brew "bat"
brew "brew-gem"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "chafa"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "erdtree"
brew "libssh2"
brew "libgit2"
brew "openssl@1.1"
brew "exa"
brew "fd"
brew "fontforge"
brew "ruby"
brew "gem-bashly"
brew "gh"
brew "ghostscript"
brew "gimme-aws-creds"
brew "git"
brew "git-delta"
brew "glow"
brew "libevent"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gradle"
brew "helix"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "librdkafka"
brew "kcat"
brew "kind"
brew "lazygit"
brew "libxml2"
brew "maven"
brew "neofetch"
brew "neovim"
brew "openjdk@17"
brew "pandoc"
brew "pipenv"
brew "pngpaste"
brew "pyenv"
brew "python@3.10"
brew "shellcheck"
brew "stern"
brew "stow"
brew "tmux"
brew "viu"
brew "watch"
brew "wget"
brew "zellij"
brew "zk"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-comp"]
brew "weaveworks/tap/eksctl"
cask "amethyst"
cask "atext"
cask "dbeaver-community"
cask "fig"
cask "flameshot"
cask "font-iosevka"
cask "font-iosevka-etoile"
cask "font-jetbrains-mono"
cask "git-credential-manager-core"
cask "intellij-idea-ce"
cask "iterm2"
cask "keycastr"
cask "macdown"
cask "mactex"
cask "openvpn-connect"
cask "rar"
cask "raycast"
cask "temurin11"
cask "temurin17"
cask "temurin8"
cask "wezterm"
vscode "adpyke.vscode-sql-formatter"
vscode "asciidoctor.asciidoctor-vscode"
vscode "ban.spellright"
vscode "bodil.file-browser"
vscode "bungcip.better-toml"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "hashicorp.terraform"
vscode "jacobdufault.fuzzy-search"
vscode "kahole.magit"
vscode "lextudio.restructuredtext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "PKief.markdown-checkbox"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust"
vscode "rust-lang.rust-analyzer"
vscode "teabyii.ayu"
vscode "tgriesser.avro-schemas"
vscode "trond-snekvik.simple-rst"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
vscode "wholroyd.jinja"
vscode "yinfei.luahelper"
vscode "YuTengjing.open-in-external-app"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
